Infineon/mtb-pdl-cat2/devices/include/cy8c4147lde_hv734.h
/*******************************************************************************
*                                     HVSS
*******************************************************************************/

#define HVSS_BASE                               0x40060000UL
#define HVSS                                    ((HVSS_Type*) HVSS_BASE)                                          /* 0x40060000 */

/*******************************************************************************
*                                    CRYPTO
*******************************************************************************/

#define CRYPTO_BASE                             0x400C0000UL
#define CRYPTO                                  ((CRYPTO_Type*) CRYPTO_BASE)                                      /* 0x400C0000 */

/*******************************************************************************
*                                     EXCO
*******************************************************************************/

#define EXCO_BASE                               0x400F0000UL
#define EXCO                                    ((EXCO_Type*) EXCO_BASE)                                          /* 0x400F0000 */

/*******************************************************************************
*                                    CPUSS
*******************************************************************************/

#define CPUSS_BASE                              0x40100000UL
#define CPUSS                                   ((CPUSS_Type*) CPUSS_BASE)                                        /* 0x40100000 */

/*******************************************************************************
*                                     DMAC
*******************************************************************************/

#define DMAC_BASE                               0x40101000UL
#define DMAC                                    ((DMAC_Type*) DMAC_BASE)                                          /* 0x40101000 */
#define DMAC_DESCR0                             ((DMAC_DESCR_Type*) &DMAC->DESCR[0])                              /* 0x40101800 */
#define DMAC_DESCR1                             ((DMAC_DESCR_Type*) &DMAC->DESCR[1])                              /* 0x40101820 */
#define DMAC_DESCR2                             ((DMAC_DESCR_Type*) &DMAC->DESCR[2])                              /* 0x40101840 */
#define DMAC_DESCR3                             ((DMAC_DESCR_Type*) &DMAC->DESCR[3])                              /* 0x40101860 */
#define DMAC_DESCR4                             ((DMAC_DESCR_Type*) &DMAC->DESCR[4])                              /* 0x40101880 */
#define DMAC_DESCR5                             ((DMAC_DESCR_Type*) &DMAC->DESCR[5])                              /* 0x401018A0 */
#define DMAC_DESCR6                             ((DMAC_DESCR_Type*) &DMAC->DESCR[6])                              /* 0x401018C0 */
#define DMAC_DESCR7                             ((DMAC_DESCR_Type*) &DMAC->DESCR[7])                              /* 0x401018E0 */
#define DMAC_DESCR8                             ((DMAC_DESCR_Type*) &DMAC->DESCR[8])                              /* 0x40101900 */
#define DMAC_DESCR9                             ((DMAC_DESCR_Type*) &DMAC->DESCR[9])                              /* 0x40101920 */
#define DMAC_DESCR10                            ((DMAC_DESCR_Type*) &DMAC->DESCR[10])                             /* 0x40101940 */
#define DMAC_DESCR11                            ((DMAC_DESCR_Type*) &DMAC->DESCR[11])                             /* 0x40101960 */
#define DMAC_DESCR12                            ((DMAC_DESCR_Type*) &DMAC->DESCR[12])                             /* 0x40101980 */
#define DMAC_DESCR13                            ((DMAC_DESCR_Type*) &DMAC->DESCR[13])                             /* 0x401019A0 */
#define DMAC_DESCR14                            ((DMAC_DESCR_Type*) &DMAC->DESCR[14])                             /* 0x401019C0 */
#define DMAC_DESCR15                            ((DMAC_DESCR_Type*) &DMAC->DESCR[15])                             /* 0x401019E0 */

/*******************************************************************************
*                                    SPCIF
*******************************************************************************/

#define SPCIF_BASE                              0x40110000UL
#define SPCIF                                   ((SPCIF_Type*) SPCIF_BASE)                                        /* 0x40110000 */

/*******************************************************************************
*                                    SPCIF1
*******************************************************************************/

#define SPCIF1_BASE                             0x40120000UL
#define SPCIF1                                  ((SPCIF1_Type*) SPCIF1_BASE)                                      /* 0x40120000 */

/*******************************************************************************
*                                    FAULT
*******************************************************************************/

#define FAULT_BASE                              0x40130000UL
#define FAULT                                   ((FAULT_Type*) FAULT_BASE)                                        /* 0x40130000 */
#define FAULT_STRUCT0                           ((FAULT_STRUCT_Type*) &FAULT->STRUCT[0])                          /* 0x40130000 */
#define FAULT_STRUCT1                           ((FAULT_STRUCT_Type*) &FAULT->STRUCT[1])                          /* 0x40130100 */

/*******************************************************************************
*                                    TCPWM
*******************************************************************************/

#define TCPWM_BASE                              0x40200000UL
#define TCPWM                                   ((TCPWM_Type*) TCPWM_BASE)                                        /* 0x40200000 */
#define TCPWM_CNT0                              ((TCPWM_CNT_Type*) &TCPWM->CNT[0])                                /* 0x40200100 */
#define TCPWM_CNT1                              ((TCPWM_CNT_Type*) &TCPWM->CNT[1])                                /* 0x40200140 */
#define TCPWM_CNT2                              ((TCPWM_CNT_Type*) &TCPWM->CNT[2])                                /* 0x40200180 */
#define TCPWM_CNT3                              ((TCPWM_CNT_Type*) &TCPWM->CNT[3])                                /* 0x402001C0 */
#define TCPWM_CNT4                              ((TCPWM_CNT_Type*) &TCPWM->CNT[4])                                /* 0x40200200 */

