Infineon/mtb-pdl-cat2/devices/include/cy8c4147lde_hv734.h
/*******************************************************************************
*                                    CANFD
*******************************************************************************/

#define CANFD0_BASE                             0x40220000UL
#define CANFD0                                  ((CANFD_Type*) CANFD0_BASE)                                       /* 0x40220000 */
#define CANFD0_CH0                              ((CANFD_CH_Type*) &CANFD0->CH[0])                                 /* 0x40220000 */
#define CANFD0_CH0_M_TTCAN                      ((CANFD_CH_M_TTCAN_Type*) &CANFD0->CH[0].M_TTCAN)                 /* 0x40220000 */

/*******************************************************************************
*                                     SCB
*******************************************************************************/

#define SCB0_BASE                               0x40240000UL
#define SCB1_BASE                               0x40250000UL
#define SCB0                                    ((CySCB_Type*) SCB0_BASE)                                         /* 0x40240000 */
#define SCB1                                    ((CySCB_Type*) SCB1_BASE)                                         /* 0x40250000 */

/*******************************************************************************
*                                     LIN
*******************************************************************************/

#define LIN0_BASE                               0x402D0000UL
#define LIN0                                    ((LIN_Type*) LIN0_BASE)                                           /* 0x402D0000 */
#define LIN0_CH0                                ((LIN_CH_Type*) &LIN0->CH[0])                                     /* 0x402D8000 */
#define LIN0_CH1                                ((LIN_CH_Type*) &LIN0->CH[1])                                     /* 0x402D8100 */

/*******************************************************************************
*                                   ISOUART
*******************************************************************************/

#define ISOUART_BASE                            0x402E0000UL
#define ISOUART                                 ((ISOUART_Type*) ISOUART_BASE)                                    /* 0x402E0000 */

/*******************************************************************************
*                                    PACSS
*******************************************************************************/

#define PACSS_BASE                              0x40300000UL
#define PACSS                                   ((PACSS_Type*) PACSS_BASE)                                        /* 0x40300000 */
#define PACSS_DCHAN0                            ((PACSS_DCHAN_Type*) &PACSS->DCHAN[0])                            /* 0x40300000 */
#define PACSS_DCHAN1                            ((PACSS_DCHAN_Type*) &PACSS->DCHAN[1])                            /* 0x40310000 */
#define PACSS_DCHAN2                            ((PACSS_DCHAN_Type*) &PACSS->DCHAN[2])                            /* 0x40320000 */
#define PACSS_DCHAN3                            ((PACSS_DCHAN_Type*) &PACSS->DCHAN[3])                            /* 0x40330000 */
#define PACSS_DCHAN0_FCFG0                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[0])               /* 0x40300100 */
#define PACSS_DCHAN0_FCFG1                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[1])               /* 0x40300110 */
#define PACSS_DCHAN0_FCFG2                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[2])               /* 0x40300120 */
#define PACSS_DCHAN0_FCFG3                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[3])               /* 0x40300130 */
#define PACSS_DCHAN0_FCFG4                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[4])               /* 0x40300140 */
#define PACSS_DCHAN0_FCFG5                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[5])               /* 0x40300150 */
#define PACSS_DCHAN0_FCFG6                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[6])               /* 0x40300160 */
#define PACSS_DCHAN0_FCFG7                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[7])               /* 0x40300170 */
#define PACSS_DCHAN0_FCFG8                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[8])               /* 0x40300180 */
#define PACSS_DCHAN0_FCFG9                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[9])               /* 0x40300190 */
#define PACSS_DCHAN0_FCFG10                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[10])              /* 0x403001A0 */
#define PACSS_DCHAN0_FCFG11                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[11])              /* 0x403001B0 */
#define PACSS_DCHAN0_FCFG12                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[12])              /* 0x403001C0 */
#define PACSS_DCHAN0_FCFG13                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[13])              /* 0x403001D0 */
#define PACSS_DCHAN0_FCFG14                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[14])              /* 0x403001E0 */
#define PACSS_DCHAN0_FCFG15                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[15])              /* 0x403001F0 */
#define PACSS_DCHAN0_FCFG16                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[16])              /* 0x40300200 */
#define PACSS_DCHAN0_FCFG17                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[17])              /* 0x40300210 */
#define PACSS_DCHAN0_FCFG18                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[18])              /* 0x40300220 */
#define PACSS_DCHAN0_FCFG19                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[19])              /* 0x40300230 */
#define PACSS_DCHAN0_FCFG20                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[20])              /* 0x40300240 */
#define PACSS_DCHAN0_FCFG21                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[21])              /* 0x40300250 */
#define PACSS_DCHAN0_FCFG22                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[22])              /* 0x40300260 */
#define PACSS_DCHAN0_FCFG23                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[23])              /* 0x40300270 */
#define PACSS_DCHAN0_FCFG24                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[24])              /* 0x40300280 */
#define PACSS_DCHAN0_FCFG25                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[25])              /* 0x40300290 */
#define PACSS_DCHAN0_FCFG26                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[26])              /* 0x403002A0 */
#define PACSS_DCHAN0_FCFG27                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[27])              /* 0x403002B0 */
#define PACSS_DCHAN0_FCFG28                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[28])              /* 0x403002C0 */
#define PACSS_DCHAN0_FCFG29                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[29])              /* 0x403002D0 */
#define PACSS_DCHAN0_FCFG30                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[30])              /* 0x403002E0 */
#define PACSS_DCHAN0_FCFG31                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[31])              /* 0x403002F0 */
#define PACSS_DCHAN0_FCFG32                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[32])              /* 0x40300300 */
#define PACSS_DCHAN0_FCFG33                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[33])              /* 0x40300310 */
#define PACSS_DCHAN0_FCFG34                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[34])              /* 0x40300320 */
#define PACSS_DCHAN0_FCFG35                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[35])              /* 0x40300330 */
#define PACSS_DCHAN0_FCFG36                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[36])              /* 0x40300340 */
#define PACSS_DCHAN0_FCFG37                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[37])              /* 0x40300350 */
#define PACSS_DCHAN0_FCFG38                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[38])              /* 0x40300360 */
#define PACSS_DCHAN0_FCFG39                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[39])              /* 0x40300370 */
#define PACSS_DCHAN0_FCFG40                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[40])              /* 0x40300380 */
#define PACSS_DCHAN0_FCFG41                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[41])              /* 0x40300390 */
#define PACSS_DCHAN0_FCFG42                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[42])              /* 0x403003A0 */
#define PACSS_DCHAN0_FCFG43                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[43])              /* 0x403003B0 */
#define PACSS_DCHAN0_FCFG44                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[44])              /* 0x403003C0 */
#define PACSS_DCHAN0_FCFG45                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[45])              /* 0x403003D0 */
#define PACSS_DCHAN0_FCFG46                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[46])              /* 0x403003E0 */
#define PACSS_DCHAN0_FCFG47                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[47])              /* 0x403003F0 */
#define PACSS_DCHAN0_FCFG48                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[48])              /* 0x40300400 */
#define PACSS_DCHAN0_FCFG49                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[49])              /* 0x40300410 */
#define PACSS_DCHAN0_FCFG50                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[50])              /* 0x40300420 */
#define PACSS_DCHAN0_FCFG51                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[51])              /* 0x40300430 */
#define PACSS_DCHAN0_FCFG52                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[52])              /* 0x40300440 */
#define PACSS_DCHAN0_FCFG53                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[53])              /* 0x40300450 */
#define PACSS_DCHAN0_FCFG54                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[54])              /* 0x40300460 */
#define PACSS_DCHAN0_FCFG55                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[55])              /* 0x40300470 */
#define PACSS_DCHAN0_FCFG56                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[56])              /* 0x40300480 */
#define PACSS_DCHAN0_FCFG57                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[57])              /* 0x40300490 */
#define PACSS_DCHAN0_FCFG58                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[58])              /* 0x403004A0 */
#define PACSS_DCHAN0_FCFG59                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[59])              /* 0x403004B0 */
#define PACSS_DCHAN0_FCFG60                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[60])              /* 0x403004C0 */
#define PACSS_DCHAN0_FCFG61                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[61])              /* 0x403004D0 */
#define PACSS_DCHAN0_FCFG62                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[62])              /* 0x403004E0 */
#define PACSS_DCHAN0_FCFG63                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[0].FCFG[63])              /* 0x403004F0 */
#define PACSS_DCHAN1_FCFG0                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[0])               /* 0x40310100 */
#define PACSS_DCHAN1_FCFG1                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[1])               /* 0x40310110 */
#define PACSS_DCHAN1_FCFG2                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[2])               /* 0x40310120 */
#define PACSS_DCHAN1_FCFG3                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[3])               /* 0x40310130 */
#define PACSS_DCHAN1_FCFG4                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[4])               /* 0x40310140 */
#define PACSS_DCHAN1_FCFG5                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[5])               /* 0x40310150 */
#define PACSS_DCHAN1_FCFG6                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[6])               /* 0x40310160 */
#define PACSS_DCHAN1_FCFG7                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[7])               /* 0x40310170 */
#define PACSS_DCHAN1_FCFG8                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[8])               /* 0x40310180 */
#define PACSS_DCHAN1_FCFG9                      ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[9])               /* 0x40310190 */
#define PACSS_DCHAN1_FCFG10                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[10])              /* 0x403101A0 */
#define PACSS_DCHAN1_FCFG11                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[11])              /* 0x403101B0 */
#define PACSS_DCHAN1_FCFG12                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[12])              /* 0x403101C0 */
#define PACSS_DCHAN1_FCFG13                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[13])              /* 0x403101D0 */
#define PACSS_DCHAN1_FCFG14                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[14])              /* 0x403101E0 */
#define PACSS_DCHAN1_FCFG15                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[15])              /* 0x403101F0 */
#define PACSS_DCHAN1_FCFG16                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[16])              /* 0x40310200 */
#define PACSS_DCHAN1_FCFG17                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[17])              /* 0x40310210 */
#define PACSS_DCHAN1_FCFG18                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[18])              /* 0x40310220 */
#define PACSS_DCHAN1_FCFG19                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[19])              /* 0x40310230 */
#define PACSS_DCHAN1_FCFG20                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[20])              /* 0x40310240 */
#define PACSS_DCHAN1_FCFG21                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[21])              /* 0x40310250 */
#define PACSS_DCHAN1_FCFG22                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[22])              /* 0x40310260 */
#define PACSS_DCHAN1_FCFG23                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[23])              /* 0x40310270 */
#define PACSS_DCHAN1_FCFG24                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[24])              /* 0x40310280 */
#define PACSS_DCHAN1_FCFG25                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[25])              /* 0x40310290 */
#define PACSS_DCHAN1_FCFG26                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[26])              /* 0x403102A0 */
#define PACSS_DCHAN1_FCFG27                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[27])              /* 0x403102B0 */
#define PACSS_DCHAN1_FCFG28                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[28])              /* 0x403102C0 */
#define PACSS_DCHAN1_FCFG29                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[29])              /* 0x403102D0 */
#define PACSS_DCHAN1_FCFG30                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[30])              /* 0x403102E0 */
#define PACSS_DCHAN1_FCFG31                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[31])              /* 0x403102F0 */
#define PACSS_DCHAN1_FCFG32                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[32])              /* 0x40310300 */
#define PACSS_DCHAN1_FCFG33                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[33])              /* 0x40310310 */
#define PACSS_DCHAN1_FCFG34                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[34])              /* 0x40310320 */
#define PACSS_DCHAN1_FCFG35                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[35])              /* 0x40310330 */
#define PACSS_DCHAN1_FCFG36                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[36])              /* 0x40310340 */
#define PACSS_DCHAN1_FCFG37                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[37])              /* 0x40310350 */
#define PACSS_DCHAN1_FCFG38                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[38])              /* 0x40310360 */
#define PACSS_DCHAN1_FCFG39                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[39])              /* 0x40310370 */
#define PACSS_DCHAN1_FCFG40                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[40])              /* 0x40310380 */
#define PACSS_DCHAN1_FCFG41                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[41])              /* 0x40310390 */
#define PACSS_DCHAN1_FCFG42                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[42])              /* 0x403103A0 */
#define PACSS_DCHAN1_FCFG43                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[43])              /* 0x403103B0 */
#define PACSS_DCHAN1_FCFG44                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[44])              /* 0x403103C0 */
#define PACSS_DCHAN1_FCFG45                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[45])              /* 0x403103D0 */
#define PACSS_DCHAN1_FCFG46                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[46])              /* 0x403103E0 */
#define PACSS_DCHAN1_FCFG47                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[47])              /* 0x403103F0 */
#define PACSS_DCHAN1_FCFG48                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[48])              /* 0x40310400 */
#define PACSS_DCHAN1_FCFG49                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[49])              /* 0x40310410 */
#define PACSS_DCHAN1_FCFG50                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[50])              /* 0x40310420 */
#define PACSS_DCHAN1_FCFG51                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[51])              /* 0x40310430 */
#define PACSS_DCHAN1_FCFG52                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[52])              /* 0x40310440 */
#define PACSS_DCHAN1_FCFG53                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[53])              /* 0x40310450 */
#define PACSS_DCHAN1_FCFG54                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[54])              /* 0x40310460 */
#define PACSS_DCHAN1_FCFG55                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[55])              /* 0x40310470 */
#define PACSS_DCHAN1_FCFG56                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[56])              /* 0x40310480 */
#define PACSS_DCHAN1_FCFG57                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[57])              /* 0x40310490 */
#define PACSS_DCHAN1_FCFG58                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[58])              /* 0x403104A0 */
#define PACSS_DCHAN1_FCFG59                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[59])              /* 0x403104B0 */
#define PACSS_DCHAN1_FCFG60                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[60])              /* 0x403104C0 */
#define PACSS_DCHAN1_FCFG61                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[61])              /* 0x403104D0 */
#define PACSS_DCHAN1_FCFG62                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[62])              /* 0x403104E0 */
#define PACSS_DCHAN1_FCFG63                     ((PACSS_DCHAN_FCFG_Type*) &PACSS->DCHAN[1].FCFG[63])              /* 0x403104F0 */
#define PACSS_ACHAN0                            ((PACSS_ACHAN_Type*) &PACSS->ACHAN[0])                            /* 0x40340000 */
#define PACSS_ACHAN1                            ((PACSS_ACHAN_Type*) &PACSS->ACHAN[1])                            /* 0x40350000 */
#define PACSS_MMIO                              ((PACSS_MMIO_Type*) &PACSS->MMIO)                                 /* 0x403F0000 */
#define PACSS_MMIO_GAINLVL_STRUCT0              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[0]) /* 0x403F0100 */
#define PACSS_MMIO_GAINLVL_STRUCT1              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[1]) /* 0x403F0110 */
#define PACSS_MMIO_GAINLVL_STRUCT2              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[2]) /* 0x403F0120 */
#define PACSS_MMIO_GAINLVL_STRUCT3              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[3]) /* 0x403F0130 */
#define PACSS_MMIO_GAINLVL_STRUCT4              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[4]) /* 0x403F0140 */
#define PACSS_MMIO_GAINLVL_STRUCT5              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[5]) /* 0x403F0150 */
#define PACSS_MMIO_GAINLVL_STRUCT6              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[6]) /* 0x403F0160 */
#define PACSS_MMIO_GAINLVL_STRUCT7              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[7]) /* 0x403F0170 */
#define PACSS_MMIO_GAINLVL_STRUCT8              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[8]) /* 0x403F0180 */
#define PACSS_MMIO_GAINLVL_STRUCT9              ((PACSS_MMIO_GAINLVL_STRUCT_Type*) &PACSS->MMIO.GAINLVL_STRUCT[9]) /* 0x403F0190 */
#define PACSS_MMIO_OCD_STRUCT0                  ((PACSS_MMIO_OCD_STRUCT_Type*) &PACSS->MMIO.OCD_STRUCT[0])        /* 0x403F0700 */
#define PACSS_MMIO_OCD_STRUCT1                  ((PACSS_MMIO_OCD_STRUCT_Type*) &PACSS->MMIO.OCD_STRUCT[1])        /* 0x403F0710 */

/** \} CY8C4147LDE-HV734 */

#endif /* _CY8C4147LDE_HV734_H_ */


/* [] END OF FILE */
